#include <stdio.h>
#include <graphics.h>
#include "shhan.h"
main()
{
int gd=0,gm,i;
char str[150];
initgraph(&gd,&gm, "");
/* VGA“e gm·¡ 0·¡£a¡ ˜a¡ ¹¡¸bÐi Ï©¶a ´ô·q
‹aœáa herc“e 640*400·¥ ‰w¶“e gm·i 1¡ 720*348·¥ ‰w¶
“e gm·i 0·a¡  xÂ´áº…”a.  */
if (gd!=9) gm=0;
shset(gd,gm);
setfillstyle(1,1);
bar(0,0,639,479);
shhan(10,10,"Ðe‹i œa·¡§aœáŸ¡ test",15,1,0,0);
shhan(10,50,"¹A¸b¸a:‰wÓ”ÐbŠa ÄñÏAÈá µeŠÒA COM.COM Ðb®‰¦¸w",15,1,0,0);
shhan(10,70,"¹A¸b´å´á:full Assembler",15,1,0,0);
shhan(10,90,"¹A¸b·©¯¡:1993‘e 9¶©",15,1,0,0);
shhan(10,110,"»¡¶¥ ‹aœÏ¢ —aœa·¡¤á:ÐáÇIŸ¡¯a,VGA,EGA",15,1,0,0);
shhan(10,130,"»¡¶¥´å´á:Turbo C 2.0 , C++",15,1,0,0);
shhan(10,150,"»¡¶¥ memory model:large model",15,1,0,0);
shhan(10,170,"œa·¡§aœáŸ¡ Ça‹¡:Í¥Ëa ¸aÁA Í¡Ðq 10000 byte",15,1,0,0);
shhan(10,230,"·¡ œa·¡§aœáŸ¡“e µÅ¸åÐe ‰·ˆ ­¡ÏaËa ¶Á´á·¡£a¡ ´a¢a ¥¢¬aÐi ® ·¶",15,1,0,0);
shhan(10,250,"·a¡a ¬w´ó¶w ­¡ÏaËa¶Á´á ¹A¸bµA•¡ ¸á¸b¸a· Ðáˆa´ô·¡ ¬a¶wÐi ® ·¶·s",15,1,0,0);
shhan(10,270,"“¡”a.¯±»¡´á ­¡¯aŒa»¡ µÅ¥bÐa‰A ‰·ˆÐaµa ¦…¬â,ˆ¸bÐi ® ·¶·s“¡”a.",15,1,0,0);
shhan(10,290,"”e ·¡ œa·¡§aœáŸ¡ ¸aÁAŸi ¬wÎ‘ÑÁ Ði ®“e ´ô·s“¡”a.",15,1,0,0);
shhan(10,350,"ÏaA¯a µA“¡Ç¡ Ê ÄåË¡“A ",15,1,0,0);
getch();
cleardevice();
bar(0,0,639,479);

shhan(10,10,"shhan libraryŸi ¬a¶wÐa‹¡ ¶áÐ¬á“e shhan.hŸi ¤e—a¯¡ Í¡Ðq¯¡Åa´¡",15,1,0,0);
shhan(10,30,"Ðs“¡”a.",15,1,0,0);
shhan(10,50,"shhan.hµA“e Ðq®· ¶¥Ñw·¡ —i´á·¶·s“¡”a.",15,1,0,0);
shhan(10,70,"Á¡‹¡ÑÁ Ðq®:shset",15,1,0,0);
shhan(10,90,"¶¥Ñw: void shset(int gd,int gm);",15,1,0,0);
shhan(10,110,"initgraphÐq® ¤a¡ –áµA ·¡ Ðq®Ÿi Ñ¡Â‰Ð º¯³¯¡¶a",15,1,0,0);
shhan(10,130,"gd:‹aœÏ¢ —aœa·¡¤áŸi »¡¸÷Ðs“¡”a.7·¡¡e HGC 9¡e VGA¡ ·¥¯¢Ðs“¡”a.",15,1,0,0);
shhan(10,150,"gm:‹aœÏ¢ ¡¡—aŸi »¡¸÷Ðs“¡”a.0:720*348  1:640*400",15,1,0,0);
shhan(10,170,"·¥®· ˆt·i ·©¦œá initgraph· ·¥®· ˆt‰Á ·©Ã¡¯¡Åa –´ö·a£a¡ ",15,1,0,0);
shhan(10,190,"initgraphµA¬á ¹¡¬aÐe gd,gm·i ‹a”¡ ¬a¶wÐi ® ·¶·s“¡”a.",15,1,0,0);
shhan(10,210,"”e HGC· ‰w¶ gmˆt·i ¸â”wÓ¡ ¬é¸÷Ð º´á´¡ Ðq",15,1,0,0);
shhan(10,250,"¬a¶wµ)",15,1,0,0);
shhan(10,270,"int gd=DETECT,gm;",15,1,0,0);
shhan(10,290,"initgraph(&gd,&gm,\"\");",15,1,0,0);
shhan(10,310,"shset(gd,gm);",15,1,0,0);
getch();
cleardevice();
bar(0,0,639,479);

shhan(10,10,"Â‰b Ðq®:shhan",15,1,0,0);
shhan(10,70,"¶¥Ñw: void shhan(int x,int y,char *str,int fcolor,int bcolor",15,1,0,0);
shhan(10,90,"                  ,int attr,int put",15,1,0,0);
shhan(10,110,"x,y:¢…¸aµi Â‰b ¶áÃ¡ »¡¸÷,‹aœÏ¢ ¹ÁÎa·±",15,1,0,0);
shhan(10,130,"str:Â‰bÐi ¢…¸aµi",15,1,0,0);
shhan(10,150,"fcolor,bcolor:¸å‰w¬‚,¤‰w¬‚",15,1,0,0);
shhan(10,170,"attr:­¢¬÷ »¡¸÷",15,1,0,0);
shhan(10,190,"put:‹i¸aŸi ÑÁ¡eµA ‘½·i˜· bitµe¬e »¡¸÷",15,1,0,0);
shhan(10,250,"¬a¶wµ)",15,1,0,0);
shhan(10,270,"shhan(10,30,\"‹±‹¡¢… ¤a¥¡\",15,1,0,0);",15,1,0,0);
getch();
cleardevice();
bar(0,0,639,479);

shhan(10,10,"¬ñ­AÐe ¹ÁÎa ¹A´á ˆa“w ",15,1,0,0);
for(i=20;i<55;i++)
shhan(10+(i-20)*16,20+i,"¬w",15,1,0,0);
shhan(10,100,"¸å‰w¬‚ ¤‰w¬‚ »¡¸÷(HGC“e ¬‚¬w»¡¶¥ ¦‰ˆa)",15,1,0,0);
shhan(10,120,"‰wÓ”ÐbŠa ÄñÏAÈá µeŠÒA COM.COM",14,4,0,0);
shhan(10,140,"‰wÓ”ÐbŠa ÄñÏAÈá µeŠÒA COM.COM",4,14,0,0);
shhan(10,160,"‰wÓ”ÐbŠa ÄñÏAÈá µeŠÒA COM.COM",1,4,0,0);
shhan(10,180,"‰wÓ”ÐbŠa ÄñÏAÈá µeŠÒA COM.COM",7,8,0,0);
shhan(10,200,"‰wÓ”ÐbŠa ÄñÏAÈá µeŠÒA COM.COM",15,0,0,0);
shhan(10,220,"‰wÓ”ÐbŠa ÄñÏAÈá µeŠÒA COM.COM",13,1,0,0);
shhan(10,240,"‰wÓ”ÐbŠa ÄñÏAÈá µeŠÒA COM.COM",12,5,0,0);
shhan(10,260,"‰wÓ”ÐbŠa ÄñÏAÈá µeŠÒA COM.COM",6,8,0,0);
shhan(10,280,"‰wÓ”ÐbŠa ÄñÏAÈá µeŠÒA COM.COM",2,3,0,0);
shhan(10,300,"‰wÓ”ÐbŠa ÄñÏAÈá µeŠÒA COM.COM",11,4,0,0);
shhan(10,320,"‹aœÏ¢‰Á· Ñ¥¶w",15,1,0,0);
for(i=0;i<200;i+=10)
circle(320,200,i);
getch();
cleardevice();
bar(0,0,639,479);

shhan(10,10,"·³b Ðq®:shget",15,1,0,0);
shhan(10,70,"¶¥Ñw: void shget(int x,int y,char *str,int fcolor,int bcolor",15,1,0,0);
shhan(10,90,"                  ,int limit,int keep",15,1,0,0);
shhan(10,110,"x,y:¢…¸aµi Â‰b ¶áÃ¡ »¡¸÷,‹aœÏ¢ ¹ÁÎa·±",15,1,0,0);
shhan(10,130,"str:Â‰bÐi ¢…¸aµi",15,1,0,0);
shhan(10,150,"fcolor,bcolor:¸å‰w¬‚,¤‰w¬‚",15,1,0,0);
shhan(10,170,"limit:ÂA” ·³b ¢…¸a®",15,1,0,0);
shhan(10,190,"keep  0:¤áÌáŸi »¡¶‰¡ ·³b ¤h·q",15,1,0,0);
shhan(10,210,"      1:¤áÌáŸi ·A»¡Ða‰¡ ·³b ¤h·q",15,1,0,0);
shhan(10,250,"¬a¶wµ)",15,1,0,0);
shhan(10,270,"char str[20];",15,1,0,0);
shhan(10,290,"shget(10,310,str,15,1,20,0);",15,1,0,0);
shget(10,310,str,15,1,20,0);
shhan(10,330,str,15,1,0,0);
getch();
cleardevice();
bar(0,0,639,479);

shhan(10,10,"·³b ¡¡—a ¹A´á Ðq®:shmode",15,1,0,0);
shhan(10,70,"¶¥Ñw: void shmode(int mode);",15,1,0,0);
shhan(10,110,"mode  0:Ðe‹i ·³b ¡¡—a",15,1,0,0);
shhan(10,130,"      1:µw¢… ·³b ¡¡—a",15,1,0,0);
shhan(10,150,"·³bº—µA modeŸi ¤aŽa¡e shift+spaceŸi ’‰œá º¯³¯¡¶a",15,1,0,0);
shhan(10,170,"Ðe‹i ¡¡—a¡ ·³b–S“¡”a.",15,1,0,0);
shmode(0);
shget(10,190,str,15,1,20,0);
shhan(10,210,"µw¢… ¡¡—a¡ ·³b–S“¡”a.",15,1,0,0);
shmode(1);
shget(10,230,str,15,1,20,0);
getch();
cleardevice();
bar(0,0,639,479);

shhan(10,10,"¸i  e—i´á ¥©a‰¡ Ð–“e•A ¥i¡ ¥©Î‘·¡ ´ô‘A¶a",15,1,0,0);
shhan(10,50,"¸å¯¡ÒAˆa ‹s¤bÐ¬á ·¡¿qÐ¬á 1.0·i  a¢Ÿ¡Ðs“¡”a.",15,1,0,0);
shhan(10,90,"¬—ˆb¥¡”a ¹©¸b·¡ aµ¥ˆõ ˆ{·e•A ¸w¸ñ·¡œa¡e Ça‹¡ˆa ¸b‰¡",15,1,0,0);
shhan(10,130,"¬a¶w·¡ ˆeÍeÐa”a“e ˆõ·³“¡”a.",15,1,0,0);
shhan(10,170,"¯¡ˆe·¡ ÐáœbÐa“e•A¡ ¹±”á ¹½·e œa·¡§aœáŸ¡Ÿi ¹A¸bÐ ¥¡‰V·s“¡”a.",15,1,0,0);
shhan(10,210,"­¡¯aŸi ‰·ˆÐ ‘½´v·a“¡ ‰Å¯±·¶“e ¦…·e µeŠÐ ¥¡¯¡‹¡ ¤aœs“¡”a.",15,1,0,04);
shhan(50,250,"ˆq¬aÐs“¡”a.",15,1,0,0);
getch();
closegraph();
}
