/* ----------------------------------------------------*/
/* --------- †e óe êi ºa : 1992 5.16   ----------------*/
/* --------- ÆÅ ∏˜ êi ºa : 1993 2.18   ----------------*/
/* --------- †e  óe   ∑° : Ø•  ¢Ö ¨Û   ----------------*/
/* --------  –a∑°…I  ID  : sms999      ----------------*/
/* ----------------------------------------------------*/

#include <stdio.h>
#include "KorHdr.h"

int main(int argc, char* argv[])
{
  const char *su="†eóe∑° : Ø•¢Ö¨Û , HITEL ID : SMS999 ";
  const int suza=10000;

//  graph_mode(0x12);       /* ãaúÅœ¢ °°óa¨È∏˜ */
//  han_font("S_HAN.FNT");  eng_font("ENGS.FNT");
//  graph_cls(1);
  graph_init(1);

  gColor(14,9);
  gputs( 9,2,0,"<<<<<<<<< ∑° àeîe–e –eãiúa∑°ßaú·ü° ¨a∂wµÅπA∑≥ì°îa. >>>>>>>>>");

  gColor(15,1);
  gputs( 4,4,0,"∑° ≠°Øaìe ega êa vgaµA¨· π°ãa†e ∏aã° úa∑°ßaú·ü°üi †eóe œaù°ãaúë∑≥ì°îa.");
  gputs( 4,5,7,"ï°çAß°Õ•Àaêa µ¢≠°ü° Õ•Àaµ¡ ∑™ìeàı∑° —°—≈ñSì°îa. ");

  gColor(11,1);
  gputs(16, 7, 1,"1> µa¨ıàaª°∫ó µb¨wãi∏a∑≥ì°îa.");
  gputs(16, 8, 2,"2> µa¨ıàaª°∫ó ∑qµwãi∏a∑≥ì°îa.");
  gputs(16, 9, 3,"3> µa¨ıàaª°∫ó ∂Aâ¬¨Âãi∏a∑≥ì°îa.");
  gputs(16,10, 4,"4> µa¨ıàaª°∫ó ãaü±∏aãi∏a∑≥ì°îa.");
  gputs(16,11, 5,"5> µa¨ıàaª°∫ó ª•–eãi∏a∑≥ì°îa.");
  gputs(16,12, 6,"6> µa¨ıàaª°∫ó £ª∫âãi∏a∑≥ì°îa.");

  gputs(16,14, 6,"  ‘Å‘Ç‘É ‘Ä ‘É‘Ç‘Å   .");
  gputs(16,16, 6,"   ˜¡  ==  ˜ª  ==  ˜æ  ==  .");

  gColor(15,4);
  gputs( 4,17,7,"¿qâ°ìe µ°¨w¢Ö≥°∑Å ãiâ¡ †a∑°«aù°≠°œaÀa¿Ç∑i ¿qâ°ù° –ñ∑sì°îa. ");

  gColor(15,2);
  gprintf(4,18,0,"%s", su);

  gColor(15,1);
  gprintf(4,19,0,"∑°%d...............è{...........",suza);

  (void) getchar();
  graph_close();          /* ãaúÅœ¢°°óa îhã° */

  return (0);
}